<script setup lang="ts">
import type { Document } from "~/stores/documentStore";

const documentStore = useDocumentStore();

const document: Document = documentStore.findDocumentWithId(
  parseInt(useRoute().params.id as string),
);

const sections = [
  {
    title: "Заголовок 1",
    text: [
      "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.",
      "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.",
    ],
  },
  {
    title: "Заголовок 2",
    text: [
      "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. \n",
    ],
  },
  {
    title: "Заголовок 3",
    text: [
      "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.",
      "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.",
    ],
  },
];

useHead({
  title: document.title,
});
</script>

<template>
  <div class="container py-5 space-y-3">
    <UIBreadcrumbs
      :items="[
        {
          label: 'Главная страница',
          to: '/',
        },
        {
          label: 'Документы',
          to: '/documents',
        },
        {
          label: document.title,
          to: `/documents/${document.id}`,
        },
      ]"
    />

    <div class="space-y-7">
      <h1 class="font-bold md:text-[41px] text-2xl">{{ document.title }}</h1>

      <section v-for="section in sections" class="space-y-4">
        <h1 class="font-bold md:text-[41px] text-2xl text-black-100">
          {{ section.title }}
        </h1>

        <div class="space-y-4">
          <p v-for="text in section.text" class="md:text-lg leading-[21.6px]">
            {{ text }}
          </p>
        </div>
      </section>
    </div>
  </div>
</template>
